---
kind: property
id: P:Autodesk.Revit.DB.SlabShapeEditor.IsEnabled
source: html/9aaaf1ca-5f52-c5be-9d5b-2230ad5131cc.htm
---
# Autodesk.Revit.DB.SlabShapeEditor.IsEnabled Property

Identifies if the slab shape editing functionality is enabled.

## Syntax (C#)
```csharp
public bool IsEnabled { get; }
```

## Remarks
If true, the creases and vertices are accessible and modifiable.
If false, no creases and vertices are accessible.